import nltk 
from nltk.chat.util import Chat, reflections # Download the necessary NLTK resources nltk.download('punkt')

# تعریف جفت عبارت‌های ورودی و پاسخ‌های چت‌ربات
pairs = [
    [
        r"my name is (.*)",
        ["سلام %1، امروز چطور می‌توانم کمکتان کنم؟"]
    ],
    [
        r"hi|hello|hey",
        ["سلام!", "درود!", "سلام! چطور کمکتان کنم؟"]
    ],
    [
        r"how are you?",
        ["من فقط یک برنامهٔ کامپیوتری هستم، اما ممنون که حال من را می‌پرسید!", "حالم خوب است، شما چطورید؟"]
    ],
    [
        r"what is your name?",
        ["من یک چت‌بات هستم که برای کمک به شما ساخته شده‌ام.", "می‌توانید مرا «چت‌ربات» صدا کنید!"]
    ],
    [
        r"quit",
        ["خداحافظ! مراقب خود باشید.", "به امید دیدار! روز خوبی داشته باشید."]
    ],
    [
        r"(.*)",
        ["متأسفم، متوجه نشدم.", "لطفاً می‌توانید جمله را دوباره بیان کنید؟"]
    ]
]

def chatbot():
    # پیام خوش‌آمدگویی و راهنمای خروج
    print("سلام! من یک چت‌ربات هستم. برای خروج 'quit' را تایپ کنید.")
    chat = Chat(pairs, reflections) 
    chat.converse()

if __name__ == "__main__":
     chatbot ()
